{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv0_weight_0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv0_bias_0", 
      "inputs": []
    }, 
    {
      "op": "cvm_op", 
      "name": "conv2d_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "relu_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "max_pool2d_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_right_shift_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_right_shift", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv1_weight_0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv1_bias_0", 
      "inputs": []
    }, 
    {
      "op": "cvm_op", 
      "name": "conv2d_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "relu_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "max_pool2d_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_right_shift_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_right_shift", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv2_weight_0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv2_bias_0", 
      "inputs": []
    }, 
    {
      "op": "cvm_op", 
      "name": "conv2d_2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "relu_2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "max_pool2d_2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_right_shift_2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_right_shift", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv3_weight_0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_conv3_bias_0", 
      "inputs": []
    }, 
    {
      "op": "cvm_op", 
      "name": "conv2d_3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "conv2d", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "relu_3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "max_pool2d_3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "flatten_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_right_shift_3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_right_shift", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "flatten_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_dense0_weight_0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mrt_quantize_DApp_dense0_bias_0", 
      "inputs": []
    }, 
    {
      "op": "cvm_op", 
      "name": "dense_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_clip_8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_clip", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_right_shift_4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_right_shift", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "const_var_6587923", 
      "inputs": []
    }, 
    {
      "op": "cvm_op", 
      "name": "broadcast_mul_0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "broadcast_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "cvm_op", 
      "name": "cvm_right_shift_5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "cvm_right_shift", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    9, 
    10, 
    17, 
    18, 
    25, 
    26, 
    35, 
    36, 
    40
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43
  ], 
  "heads": [[42, 0, 0]], 
  "attrs": {
    "op_attrs": ["list_str", [
        "{\"__shape__\": \"[1, 1, 28, 28]\", \"precision\": \"8\"}", 
        "{\"precision\": \"8\", \"__shape__\": \"(16, 1, 3, 3)\"}", 
        "{\"precision\": \"14\", \"__shape__\": \"(16,)\"}", 
        "{\"use_bias\": \"True\", \"kernel_size\": \"(3, 3)\", \"channels\": \"16\", \"layout\": \"NCHW\", \"strides\": \"(1, 1)\", \"kernel_layout\": \"OIHW\", \"groups\": \"1\", \"padding\": \"(0, 0)\", \"dilation\": \"(1, 1)\"}", 
        "{\"precision\": \"17\"}", 
        "{}", 
        "{\"precision\": \"15\"}", 
        "{\"ceil_mode\": \"False\", \"padding\": \"(0, 0)\", \"pool_size\": \"(2, 2)\", \"strides\": \"(1, 1)\"}", 
        "{\"shift_bit\": \"7\", \"precision\": \"8\"}", 
        "{\"precision\": \"8\", \"__shape__\": \"(32, 16, 3, 3)\"}", 
        "{\"precision\": \"13\", \"__shape__\": \"(32,)\"}", 
        "{\"use_bias\": \"True\", \"kernel_size\": \"(3, 3)\", \"channels\": \"32\", \"layout\": \"NCHW\", \"strides\": \"(1, 1)\", \"kernel_layout\": \"OIHW\", \"groups\": \"1\", \"padding\": \"(0, 0)\", \"dilation\": \"(1, 1)\"}", 
        "{\"precision\": \"17\"}", 
        "{}", 
        "{\"precision\": \"15\"}", 
        "{\"ceil_mode\": \"False\", \"padding\": \"(0, 0)\", \"pool_size\": \"(2, 2)\", \"strides\": \"(1, 1)\"}", 
        "{\"shift_bit\": \"7\", \"precision\": \"8\"}", 
        "{\"precision\": \"8\", \"__shape__\": \"(64, 32, 3, 3)\"}", 
        "{\"precision\": \"14\", \"__shape__\": \"(64,)\"}", 
        "{\"use_bias\": \"True\", \"kernel_size\": \"(3, 3)\", \"channels\": \"64\", \"layout\": \"NCHW\", \"strides\": \"(1, 1)\", \"kernel_layout\": \"OIHW\", \"groups\": \"1\", \"padding\": \"(0, 0)\", \"dilation\": \"(1, 1)\"}", 
        "{\"precision\": \"18\"}", 
        "{}", 
        "{\"precision\": \"17\"}", 
        "{\"ceil_mode\": \"False\", \"padding\": \"(0, 0)\", \"pool_size\": \"(2, 2)\", \"strides\": \"(2, 2)\"}", 
        "{\"shift_bit\": \"9\", \"precision\": \"8\"}", 
        "{\"precision\": \"8\", \"__shape__\": \"(128, 64, 1, 1)\"}", 
        "{\"precision\": \"12\", \"__shape__\": \"(128,)\"}", 
        "{\"use_bias\": \"True\", \"kernel_size\": \"(1, 1)\", \"channels\": \"128\", \"layout\": \"NCHW\", \"strides\": \"(1, 1)\", \"kernel_layout\": \"OIHW\", \"groups\": \"1\", \"padding\": \"(0, 0)\", \"dilation\": \"(1, 1)\"}", 
        "{\"precision\": \"16\"}", 
        "{}", 
        "{\"precision\": \"15\"}", 
        "{\"ceil_mode\": \"False\", \"padding\": \"(0, 0)\", \"pool_size\": \"(2, 2)\", \"strides\": \"(2, 2)\"}", 
        "{}", 
        "{\"shift_bit\": \"7\", \"precision\": \"8\"}", 
        "{}", 
        "{\"precision\": \"8\", \"__shape__\": \"(10, 3200)\"}", 
        "{\"precision\": \"12\", \"__shape__\": \"(10,)\"}", 
        "{\"use_bias\": \"True\", \"units\": \"10\"}", 
        "{\"precision\": \"18\"}", 
        "{\"shift_bit\": \"10\", \"precision\": \"8\"}", 
        "{\"precision\": \"24\", \"__shape__\": \"(1,)\"}", 
        "{}", 
        "{\"shift_bit\": \"22\", \"precision\": \"8\"}"]], 
    "shape": ["list_shape", [
        [1, 1, 28, 28], 
        [16, 1, 3, 3], 
        [16], 
        [1, 16, 26, 26], 
        [1, 16, 26, 26], 
        [1, 16, 26, 26], 
        [1, 16, 26, 26], 
        [1, 16, 25, 25], 
        [1, 16, 25, 25], 
        [32, 16, 3, 3], 
        [32], 
        [1, 32, 23, 23], 
        [1, 32, 23, 23], 
        [1, 32, 23, 23], 
        [1, 32, 23, 23], 
        [1, 32, 22, 22], 
        [1, 32, 22, 22], 
        [64, 32, 3, 3], 
        [64], 
        [1, 64, 20, 20], 
        [1, 64, 20, 20], 
        [1, 64, 20, 20], 
        [1, 64, 20, 20], 
        [1, 64, 10, 10], 
        [1, 64, 10, 10], 
        [128, 64, 1, 1], 
        [128], 
        [1, 128, 10, 10], 
        [1, 128, 10, 10], 
        [1, 128, 10, 10], 
        [1, 128, 10, 10], 
        [1, 128, 5, 5], 
        [1, 3200], 
        [1, 3200], 
        [1, 3200], 
        [10, 3200], 
        [10], 
        [1, 10], 
        [1, 10], 
        [1, 10], 
        [1], 
        [1, 10], 
        [1, 10]]]
  }
}
